wrn_28_10 model built as child model.
 Model summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 16)   448         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 16)   64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 160)  23200       activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 160)  640         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 160)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 160)  230560      activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 160)  640         conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 160)  2720        activation_1[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 160)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 160)  0           conv2d_2[0][0]                   
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 160)  230560      add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 160)  640         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 160)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 160)  230560      activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 160)  640         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 160)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 160)  0           add_1[0][0]                      
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 160)  230560      add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 160)  640         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 160)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 160)  230560      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 160)  640         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 160)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 160)  0           add_2[0][0]                      
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 160)  230560      add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 32, 160)  640         conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 32, 160)  0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 160)  230560      activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 32, 160)  640         conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 32, 160)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 32, 160)  0           add_3[0][0]                      
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 16, 16, 160)  0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 320)  461120      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 320)  1280        conv2d_12[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 16, 16, 320)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 320)  921920      activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 320)  1280        conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 320)  51520       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 320)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 320)  0           conv2d_11[0][0]                  
                                                                 activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 320)  921920      add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 320)  1280        conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 320)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 16, 16, 320)  921920      activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 320)  1280        conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 320)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 16, 320)  0           add_5[0][0]                      
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 16, 16, 320)  921920      add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 16, 16, 320)  1280        conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 16, 16, 320)  0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 16, 16, 320)  921920      activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 16, 16, 320)  1280        conv2d_17[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 16, 16, 320)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
add_7 (Add)                     (None, 16, 16, 320)  0           add_6[0][0]                      
                                                                 activation_15[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 16, 16, 320)  921920      add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 16, 16, 320)  1280        conv2d_18[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 16, 16, 320)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 16, 16, 320)  921920      activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 16, 16, 320)  1280        conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 16, 16, 320)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
add_8 (Add)                     (None, 16, 16, 320)  0           add_7[0][0]                      
                                                                 activation_17[0][0]              
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 8, 8, 320)    0           add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 8, 8, 640)    1843840     max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 640)    2560        conv2d_21[0][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 8, 8, 640)    0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 8, 8, 640)    3687040     activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 8, 8, 640)    2560        conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 8, 8, 640)    205440      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 8, 8, 640)    0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
add_9 (Add)                     (None, 8, 8, 640)    0           conv2d_20[0][0]                  
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 8, 8, 640)    3687040     add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 8, 8, 640)    2560        conv2d_23[0][0]                  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 8, 8, 640)    0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 8, 8, 640)    3687040     activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 8, 8, 640)    2560        conv2d_24[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 8, 8, 640)    0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
add_10 (Add)                    (None, 8, 8, 640)    0           add_9[0][0]                      
                                                                 activation_21[0][0]              
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 8, 8, 640)    3687040     add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 8, 8, 640)    2560        conv2d_25[0][0]                  
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 8, 8, 640)    0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 8, 8, 640)    3687040     activation_22[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 8, 8, 640)    2560        conv2d_26[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 8, 8, 640)    0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
add_11 (Add)                    (None, 8, 8, 640)    0           add_10[0][0]                     
                                                                 activation_23[0][0]              
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 8, 8, 640)    3687040     add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 8, 8, 640)    2560        conv2d_27[0][0]                  
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 8, 8, 640)    0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 8, 8, 640)    3687040     activation_24[0][0]              
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 8, 8, 640)    2560        conv2d_28[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 8, 8, 640)    0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
add_12 (Add)                    (None, 8, 8, 640)    0           add_11[0][0]                     
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 640)          0           add_12[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100)          64100       global_average_pooling2d_1[0][0] 
==================================================================================================
Total params: 36,564,932
Trainable params: 36,546,980
Non-trainable params: 17,952
__________________________________________________________________________________________________
None
fitting the model
Epoch 1/100
Policies are:
[{'aug1_type': 'horizontal-flip', 'aug1_magnitude': 0.894, 'aug2_type': 'crop', 'aug2_magnitude': 0.163}, {'aug1_type': 'translate-y', 'aug1_magnitude': 0.91, 'aug2_type': 'RandomEracing', 'aug2_magnitude': 0.042}, {'aug1_type': 'invert', 'aug1_magnitude': 0.937, 'aug2_type': 'invert', 'aug2_magnitude': 0.484}, {'aug1_type': 'RandomEracing', 'aug1_magnitude': 0.079, 'aug2_type': 'RandomEracing', 'aug2_magnitude': 0.001}, {'aug1_type': 'emboss', 'aug1_magnitude': 0.015, 'aug2_type': 'RandomEracing', 'aug2_magnitude': 0.24600000000000002}]

horizontal-flip 0.894 [[[[183. 116.  42.]
   [212. 143.  19.]
   [203. 123.  11.]
   ...
   [227. 199.  25.]
   [199. 164.  21.]
   [198. 150.  25.]]

  [[193. 121.  54.]
   [195. 120.  22.]
   [207. 131.  13.]
   ...
   [237. 207.  26.]
   [214. 166.  23.]
   [213. 150.  12.]]

  [[227. 167.  48.]
   [189. 117.  24.]
   [176. 102.  15.]
   ...
   [240. 211.   9.]
   [223. 176.   5.]
   [217. 153.   7.]]

  ...

  [[194. 161. 128.]
   [176. 144. 114.]
   [167. 147. 113.]
   ...
   [147.  98.  66.]
   [155. 116.  88.]
   [180. 143. 102.]]

  [[194. 161. 112.]
   [171. 139. 101.]
   [213. 188. 149.]
   ...
   [155.  99.  63.]
   [187. 156. 118.]
   [201. 177. 127.]]

  [[184. 157. 119.]
   [165. 136. 106.]
   [171. 140. 104.]
   ...
   [156. 105.  70.]
   [181. 154. 119.]
   [167. 147. 111.]]]


 [[[  2.   2.   2.]
   [  3.   3.   3.]
   [  2.   2.   2.]
   ...
   [  4.   4.   4.]
   [  3.   3.   3.]
   [  2.   2.   2.]]

  [[  2.   2.   2.]
   [  2.   2.   2.]
   [  2.   2.   2.]
   ...
   [  3.   3.   3.]
   [  4.   4.   4.]
   [  3.   3.   3.]]

  [[  2.   2.   2.]
   [  2.   2.   2.]
   [  2.   2.   2.]
   ...
   [  5.   5.   5.]
   [  6.   6.   6.]
   [  4.   4.   4.]]

  ...

  [[ 92. 153.  80.]
   [ 97. 161.  88.]
   [ 94. 159.  86.]
   ...
   [ 81. 109.  77.]
   [ 92. 125.  85.]
   [100. 138.  89.]]

  [[ 86. 147.  77.]
   [ 89. 153.  79.]
   [ 84. 150.  75.]
   ...
   [ 65. 124.  62.]
   [ 66. 123.  59.]
   [ 71. 128.  61.]]

  [[ 76. 140.  72.]
   [ 73. 142.  67.]
   [ 69. 139.  63.]
   ...
   [ 67. 140.  76.]
   [ 61. 133.  66.]
   [ 64. 134.  65.]]]


 [[[159. 158. 176.]
   [162. 161. 179.]
   [169. 168. 186.]
   ...
   [143. 149. 176.]
   [148. 152. 177.]
   [155. 155. 177.]]

  [[159. 158. 176.]
   [168. 167. 185.]
   [175. 174. 192.]
   ...
   [144. 149. 178.]
   [149. 153. 180.]
   [156. 156. 179.]]

  [[168. 167. 185.]
   [172. 171. 189.]
   [175. 174. 191.]
   ...
   [151. 156. 186.]
   [157. 160. 189.]
   [164. 164. 189.]]

  ...

  [[220. 221. 240.]
   [220. 221. 240.]
   [223. 224. 243.]
   ...
   [219. 222. 241.]
   [223. 226. 244.]
   [225. 227. 248.]]

  [[219. 220. 241.]
   [218. 219. 239.]
   [222. 223. 243.]
   ...
   [217. 221. 239.]
   [222. 226. 244.]
   [226. 229. 249.]]

  [[218. 219. 240.]
   [217. 218. 238.]
   [220. 221. 241.]
   ...
   [216. 218. 238.]
   [221. 223. 243.]
   [224. 227. 248.]]]


 [[[215. 215. 213.]
   [191. 190. 185.]
   [196. 194. 186.]
   ...
   [186. 183. 176.]
   [185. 180. 176.]
   [204. 204. 199.]]

  [[153. 154. 147.]
   [ 89.  89.  74.]
   [107. 106.  87.]
   ...
   [ 57.  46.  25.]
   [ 48.  38.  21.]
   [108. 106.  95.]]

  [[156. 157. 146.]
   [ 88.  89.  68.]
   [ 94.  93.  73.]
   ...
   [ 47.  34.   8.]
   [ 32.  21.   0.]
   [ 97.  93.  80.]]

  ...

  [[111. 111. 108.]
   [  0.   1.   0.]
   [  9.  10.   2.]
   ...
   [ 93.  94.  88.]
   [ 82.  83.  78.]
   [118. 118. 116.]]

  [[108. 108. 106.]
   [  0.   0.   0.]
   [  7.   8.   0.]
   ...
   [ 51.  52.  46.]
   [ 88.  89.  86.]
   [121. 121. 121.]]

  [[185. 185. 183.]
   [130. 130. 126.]
   [136. 136. 131.]
   ...
   [142. 143. 140.]
   [158. 158. 157.]
   [185. 185. 185.]]]]
translate-y 0.91 [[[[ 69.  83.  46.]
   [ 75.  96.  60.]
   [ 85. 112.  77.]
   ...
   [130. 136.  87.]
   [124. 127.  79.]
   [ 94.  97.  53.]]

  [[ 69.  84.  41.]
   [ 88. 109.  71.]
   [ 96. 124.  90.]
   ...
   [124. 135.  88.]
   [114. 122.  76.]
   [ 72.  76.  35.]]

  [[ 76.  92.  43.]
   [ 89. 110.  69.]
   [110. 138. 103.]
   ...
   [142. 159. 117.]
   [120. 132.  91.]
   [ 82.  88.  48.]]

  ...

  [[146. 182. 172.]
   [176. 208. 199.]
   [185. 216. 208.]
   ...
   [197. 223. 213.]
   [193. 219. 209.]
   [193. 218. 209.]]

  [[163. 198. 188.]
   [181. 213. 204.]
   [192. 222. 214.]
   ...
   [202. 227. 215.]
   [196. 222. 210.]
   [205. 229. 218.]]

  [[180. 212. 203.]
   [189. 219. 211.]
   [199. 227. 220.]
   ...
   [195. 218. 206.]
   [195. 218. 206.]
   [205. 227. 216.]]]


 [[[ 23.  15.  14.]
   [ 29.  17.  23.]
   [ 43.  38.  37.]
   ...
   [ 17.  20.  17.]
   [ 26.  22.  20.]
   [ 29.  21.  19.]]

  [[ 31.  10.  15.]
   [ 30.  10.  11.]
   [ 76.  65.  62.]
   ...
   [ 16.  18.  17.]
   [ 22.  18.  18.]
   [ 28.  22.  20.]]

  [[ 71.  28.  17.]
   [ 74.  32.  18.]
   [ 79.  48.  38.]
   ...
   [ 16.  18.  18.]
   [ 16.  13.  14.]
   [ 19.  17.  15.]]

  ...

  [[ 40.  20.  13.]
   [ 60.  45.  25.]
   [ 41.  38.  37.]
   ...
   [ 45.  53.  45.]
   [ 24.  28.  24.]
   [ 12.  12.  13.]]

  [[ 36.  18.  12.]
   [ 53.  40.  27.]
   [ 24.  20.  18.]
   ...
   [ 66.  69.  66.]
   [ 53.  55.  53.]
   [ 67.  67.  69.]]

  [[ 32.  21.  18.]
   [ 32.  22.  18.]
   [ 24.  17.  12.]
   ...
   [ 75.  75.  76.]
   [ 84.  84.  86.]
   [ 79.  79.  81.]]]


 [[[124. 162.  99.]
   [122. 160. 100.]
   [124. 162. 106.]
   ...
   [145. 176. 106.]
   [148. 179. 109.]
   [149. 180. 110.]]

  [[ 95. 133.  75.]
   [105. 143.  88.]
   [127. 164. 111.]
   ...
   [145. 176. 107.]
   [145. 176. 108.]
   [147. 178. 109.]]

  [[ 89. 126.  72.]
   [ 68. 105.  53.]
   [100. 137.  86.]
   ...
   [145. 176. 109.]
   [143. 174. 107.]
   [144. 175. 108.]]

  ...

  [[ 93. 132.  87.]
   [ 91. 130.  86.]
   [ 96. 136.  91.]
   ...
   [128. 166. 106.]
   [132. 171. 108.]
   [124. 162.  97.]]

  [[108. 146. 101.]
   [ 93. 132.  87.]
   [ 94. 133.  88.]
   ...
   [122. 161.  97.]
   [120. 159.  94.]
   [122. 161.  94.]]

  [[100. 139.  92.]
   [101. 140.  92.]
   [104. 143.  96.]
   ...
   [114. 153.  90.]
   [121. 160.  96.]
   [125. 164.  98.]]]


 [[[ 79.  61.  62.]
   [ 90.  69.  66.]
   [105.  84.  77.]
   ...
   [113. 118.  97.]
   [106. 111.  90.]
   [101. 107.  87.]]

  [[ 85.  67.  68.]
   [ 97.  76.  73.]
   [118.  97.  90.]
   ...
   [103. 108.  88.]
   [105. 108.  96.]
   [103. 106.  88.]]

  [[ 89.  69.  67.]
   [ 96.  75.  70.]
   [116.  96.  89.]
   ...
   [ 96. 100.  81.]
   [ 97. 104.  91.]
   [ 99. 106.  88.]]

  ...

  [[225. 190. 158.]
   [215. 183. 147.]
   [195. 166. 123.]
   ...
   [118. 143.  82.]
   [123. 149.  81.]
   [123. 149.  82.]]

  [[225. 205. 183.]
   [199. 188. 156.]
   [179. 175. 136.]
   ...
   [117. 131.  87.]
   [124. 142.  85.]
   [129. 148.  91.]]

  [[207. 193. 167.]
   [207. 191. 166.]
   [207. 190. 168.]
   ...
   [143. 150. 114.]
   [135. 143.  97.]
   [134. 145.  98.]]]]
